"""
Instructions
ขอให้สร้าง function ชื่อ deposit(money) ที่เป็นโปรแกรมจำลองการฝากเงินเข้าบัญชี โดยกำหนดยอดเงินเริ่มต้นเป็น 1,000 บาท โปรแกรมต้องรับจำนวนเงินที่ต้องการฝากจากผู้ใช้ 1 ครั้ง แล้วคำนวณยอดคงเหลือใหม่

    -ใช้ try-except เพื่อจัดการกรณีผู้ใช้กรอกข้อมูลที่แปลงเป็นตัวเลขไม่ได้ เช่น abc
    -หากจำนวนเงินฝากน้อยกว่าหรือเท่ากับ 0 ให้ใช้ raise ValueError พร้อมข้อความ จำนวนเงินฝากต้องมากกว่า 0
    -หากข้อมูลถูกต้อง ให้ใช้ else แสดงยอดเงินคงเหลือใหม่
    -ใช้ finally แสดงข้อความ สิ้นสุดรายการฝากเงิน เสมอ
    -ห้ามใช้ except: แบบไม่ระบุชนิดข้อผิดพลาด

เมื่อสร้าง function แล้ว ขอให้ทดลองใช้ function ที่สร้างด้วย

ตัวอย่างหน้าจอ กรณีปกติ
ยอดเงินเริ่มต้น: 1000 บาท
กรอกจำนวนเงินที่ต้องการฝาก: 500

ฝากเงินสำเร็จ
ยอดเงินคงเหลือ: 1500.00 บาท
สิ้นสุดรายการฝากเงิน

ตัวอย่างหน้าจอ กรณ๊มีการกรอกข้อมูลผิดพลาด
ยอดเงินเริ่มต้น: 1000 บาท
กรอกจำนวนเงินที่ต้องการฝาก: -200

เกิดข้อผิดพลาด: จำนวนเงินฝากต้องมากกว่า 0
สิ้นสุดรายการฝากเงิน
"""


def deposit(money):
    print(f"ยอดเงินเริ่มต้น : {money} บาท")

    try:
        amount = float(input("กรอกจำนวนเงินที่ต้องการฝาก : "))

        if amount <= 0:
            raise ValueError("จำนวนเงินฝากต้องมากกว่า 0")

    except ValueError as e:
        print(f"\nเกิดข้อผิดพลาด : {e} ")

    else:
        money += amount
        print("\nฝากเงินสำเร็จ")
        print(f"ยอดเงินคงเหลือ : {money :.2f} บาท")

    finally:
        print("สิ้นสุดรายการฝากเงิน")

deposit(1000)